Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: `C++ multisets <http://www.demo2s.com/Tutorial/Cpp/0380__set-multiset/Catalog0380__set-multiset.htm>`_ tutorial with examples.
pl: `Wielozbiory C++ <http://www.java2s.com/Tutorial/Cpp/0380__set-multiset/0120__multiset.htm>`_ samouczek z przykładami.

source: For mathematical operations on multisets and their use cases, see *Knuth, Donald. The Art of Computer Programming Volume II, Section 4.6.3, Exercise 19*\.
pl: Dla matematycznych operacji na wielozbiorach i ich przypadkach użycia, zobacz *Knuth, Donald. Sztuka programowania komputerów Tom II, Rozdział 4.6.3, Ćwiczenie 19*\.

source: To enumerate all distinct multisets of a given size over a given set of elements, see :func:`itertools.combinations_with_replacement`.
pl: Aby wyliczyć wszystkie różne wielozbiory danego rozmiaru ponad danym zbiorem elementów, zobacz :func:`itertools.combinations_with_replacement`.

source: :class:`deque` objects
pl: przedmioty :class:`deque`

source: Returns a new deque object initialized left-to-right (using :meth:`append`) with data from *iterable*. If *iterable* is not specified, the new deque is empty.
pl: Zwraca nowy przedmiot dwukońcowej kolejki zainicjowany od lewej strony do prawej (używając sposobu postępowania :meth:`append`) z danymi z przedmiotu *iterowalnego*. Jeśli przedmiot *iterowalny* jest nieokreślony, nowy przedmiot dwukońcowej kolejki jest pusty.

source: Deques are a generalization of stacks and queues (the name is pronounced "deck" and is short for "double-ended queue"). Deques support thread-safe, memory efficient appends and pops from either side of the deque with approximately the same O(1) performance in either direction.
pl: Przedmioty dwukońcowej kolejki - deque - są uogólnieniem sterty i kolejki (nazwa jest wymawiana jak "deck" i jest skrótem od "dwukońcowej kolejki"). Dwukońcowe kolejki wspierają bezpieczne dla wątków, efektywne pod względem wykorzystania pamięci działania dodania na koniec i pobrania z każdego z dwóch końców dwukońcowej kolejki z w przybliżeniu tą samą prędkością O(1) w każdym kierunku.

source: Though :class:`list` objects support similar operations, they are optimized for fast fixed-length operations and incur O(n) memory movement costs for ``pop(0)`` and ``insert(0, v)`` operations which change both the size and position of the underlying data representation.
pl: Chociaż przedmioty :class:`list` wspierają podobne operacje, są optymalizowane dla szybkich stałej długości operacji i ponoszą koszty przenoszenia pamięci O(n) dla ``pop(0) i ``insert(0, v)`` które zmieniają zarówno rozmiar jak i pozycję leżących u podstaw reprezentacji danych.

source: If *maxlen* is not specified or is *None*, deques may grow to an arbitrary length. Otherwise, the deque is bounded to the specified maximum length. Once a bounded length deque is full, when new items are added, a corresponding number of items are discarded from the opposite end. Bounded length deques provide functionality similar to the ``tail`` filter in Unix. They are also useful for tracking transactions and other pools of data where only the most recent activity is of interest.
pl: Jeśli *maxlen* nie jest określona lub jest *None*, podwójnie zakończone kolejki mogą rozrosnąć się do dowolnej długości. W przeciwnym razie, podwójnie zakończone kolejki są ograniczone do określonej maksymalnej długości. Gdy określonej długości kolejka jest pełna, gdy nowe elementy są dodawane, odpowiadająca liczba elementów jest odrzucana z przeciwnego końca. Określonej długości kolejki dostarczają funkcjonalności podobnej do filtra ``ogona`` - z ang. - ``tail`` w Unix-ie. Są one także użyteczne dla podążania za transakcjami i innego rodzaju danymi, gdzie tylko najświeższe aktywności są przedmiotem zainteresowania.

source: Deque objects support the following methods:
pl: Przedmioty podwójnie zakończonych kolejek wspierają następujące sposoby postępowania:

source: Add *x* to the right side of the deque.
pl: Dodaj *x* do prawej strony podwójnie zakończonej kolejki.

source: Add *x* to the left side of the deque.
pl: Dodaj *x* do lewej strony podwójnie zakończonej kolejki.

source: Remove all elements from the deque leaving it with length 0.
pl: Zdejmij wszystkie elementy podwójnie zakończonej kolejki zostawiając ją z długością 0.

source: Count the number of deque elements equal to *x*.
pl: Policz liczbę elementów podwójnie zakończonej kolejki równych *x*.

source: Extend the right side of the deque by appending elements from the iterable argument.
pl: Rozszerz prawą stronę podwójnie zakończonej kolejki przez doklejenie elementów z iterowalnego parametru.

source: Extend the left side of the deque by appending elements from *iterable*. Note, the series of left appends results in reversing the order of elements in the iterable argument.
pl: Rozszerz lewą stronę podwójnie zakończonej kolejki przez doklejenie elementów z *iterowalnego* parametru. Zauważ, że seria lewych doklejeń powoduje odwrócenie kolejności elementów w parametrze iterowalnym.

source: Remove and return an element from the right side of the deque. If no elements are present, raises an :exc:`IndexError`.
pl: Zdejmij i zwróć element z prawej strony podwójnie zakończonej kolejki. Jeśli żadne elementy nie są obecne, zgłoś :exc:`IndexError`.

source: Remove and return an element from the left side of the deque. If no elements are present, raises an :exc:`IndexError`.
pl: Zdejmij i zwróć element z lewej strony podwójnie zakończonej kolejki. Jeśli żadne elementy nie są obecne zgłoś :exc:`IndexError`.

source: Removed the first occurrence of *value*. If not found, raises a :exc:`ValueError`.
pl: Zdejmij pierwsze napotkane wystąpienie *wartości*. Jeśli nie znaleziono, zgłasza :exc:`ValueError`.

source: Reverse the elements of the deque in-place and then return ``None``.
pl: Odwróć elementy podwójnie zakończonej kolejki na-miejscu a potem zwróć ``None`` - z ang. - ``Żaden``.

source: Rotate the deque *n* steps to the right. If *n* is negative, rotate to the left. Rotating one step to the right is equivalent to: ``d.appendleft(d.pop())``.
pl: Obróć podwójnie zakończoną kolejkę *n* razy w prawo. Jeśli *n* jest ujemne obróć w lewo. Obrócenie jeden raz w prawo jest równoważne: ``d.appendleft(d.pop())``.

source: Deque objects also provide one read-only attribute:
pl: Przedmioty podwójnie zakończonej kolejki dostarczają także jedną właściwość tylko do odczytu:

source: Maximum size of a deque or *None* if unbounded.
pl: Maksymalny rozmiar podwójnie zakończonej kolejki lub *Żaden* - z ang. - *None* jeśli bez ograniczenia.

source: In addition to the above, deques support iteration, pickling, ``len(d)``, ``reversed(d)``, ``copy.copy(d)``, ``copy.deepcopy(d)``, membership testing with the :keyword:`in` operator, and subscript references such as ``d[-1]``. Indexed access is O(1) at both ends but slows to O(n) in the middle. For fast random access, use lists instead.
pl: W dodatku do powyższego podwójnie zakończone kolejki wspierają iterację, peklowanie, ``len(d)`` - długość, ``reversed(d)`` - odwróconą kolejność, ``copy.copy(d)`` - kopię, ``copy.deepcopy(d)`` - głęboką kopię, sprawdzanie przynależności z użyciem operatora :keyword:`in` i odniesieniami w podtekście takimi, jak ``d[-1]``. Indeksowany dostęp jest O(1) na obu końcach ale zwalnia do O(n) w środku. Dla szybkich przypadkowych dostępów, użyj list zamiast tego.

source: Example:
pl: Przykład:
